print("변수 k 를 선언하고 -100을 대입하여 출력하는 프로그램을 작성하세요")
k=-100
print(k,"\n")
print("변수 x,y를 선언하여 -1과 100을 대입한 후 x,y값을  출력하는 프로그램을 작성하세요")
x=-1
y=100
print("x=",x,", y=",y,"\n")
print("변수 i=10, j=0를 선언하고 j에 i에 있는 값을 대입하여 i, j값을 출력하는 프로그램을 작성하세요 ")
i=10
j=0
j=i
print("i=",i,", j=",j,"\n")
print("다음 두 값을 변수 w(추의무게),  g(중력의 비율)에 저장하고\n두 변수의 곱셈 계산결과를 출력하는 프로그램을 작성하세요.\n추의 무게 = 49, 중력의 비율 = 0.2683")
w=49
g=0.2683
print("추의 무게는",w,"이고","중력의 비율은",g,"이므로, 추에 작용하는 중력의 크기는",w*g,"이다\n")
print("1야드(yd)는 91.44cm이고 1인치(in)는 2.54cm이다. 2.1야드와 10.5인치를 각각 cm로 변환하여 출력하세요")
y=91.44
i=2.54
#둘다 실수형태의 자료이다.
print("2.1yd는",y*2.1,"cm이고, 10.5인치는",i*10.5,"cm이다.\n")
print("다음 \"출력 예\"와 같이 출력하는 프로그램을 작성하시오.\n출력예) My name is Hong")
print("My name is Hong\n")
print("다음과 같이 두개의 변수에 저장될 문자열을 하나의 변수에 저장하여 출력되는 프로그램을 작성하시오.\n변수 str1= \"I am\", 변수 str2=\"a boy\"\n출력 예) I am a boy")
str1='I am'
str2=' a boy'
print(str1+str2)
print("키를 입력받아 다음과 같이 출력하는 프로그램을 작성하세요\n예) 180을 입력한 경우 : my height = 180")
input("키를 입력하시오 : ")
print("")